In [1]:
import numpy as np
import pandas as pd

Creation of Pandas Series

In [2]:
pds = pd.Series(list("abcdef"),range(0,6,1))

In [3]:
pds

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

accessing elements of Series

In [4]:
pds[0]

'a'

In [5]:
pds1=pd.Series(list("lmnopq"),range(0,6,1))
pds2=pd.Series(list("tuvwxy"),range(0,6,1))
pds3=pd.Series(["apple","orange","banana","grapes","melon","pineapple"],range(0,6,1))
pds4=pd.Series(["blue","red","green","violet","white","black"],range(0,6,1))

+ operation on series

In [6]:
pds+pds1

0    al
1    bm
2    cn
3    do
4    ep
5    fq
dtype: object

Creation of DataFrame from python dictionary whihch includes Pandas series

In [7]:
df1 = {"one":pds,"two":pds1,"three":pds3,"four":pds4}
pd_df1 = pd.DataFrame(df1)

In [8]:
pd_df1

     four one      three two
0    blue   a      apple   l
1     red   b     orange   m
2   green   c     banana   n
3  violet   d     grapes   o
4   white   e      melon   p
5   black   f  pineapple   q

In [9]:
pds5=pd.Series(list("7896"),range(4,8))

In [10]:
df2={"alfa":pds4,"beta":pds5}
pd_df2=pd.DataFrame(df2)

In [11]:
pd_df2

     alfa beta
0    blue  NaN
1     red  NaN
2   green  NaN
3  violet  NaN
4   white    7
5   black    8
6     NaN    9
7     NaN    6

Accessing a particular column

In [12]:
pd_df2["alfa"]

0      blue
1       red
2     green
3    violet
4     white
5     black
6       NaN
7       NaN
Name: alfa, dtype: object

Accessing a group of particular columns

In [13]:
pd_df1[["one","three"]]

  one      three
0   a      apple
1   b     orange
2   c     banana
3   d     grapes
4   e      melon
5   f  pineapple

Accessing a particlar cell using index and column names

In [14]:
pd_df1.loc[0,"one"]

'a'

Accessing a particlar cell using index and column id(numbers)

In [15]:
pd_df1.iloc[5,2]

'pineapple'

Adding a new column to a dataframe

In [16]:
pd_df1["ten"]=pd.Series(range(10,70,10),range(0,6))

In [17]:
pd_df1

     four one      three two  ten
0    blue   a      apple   l   10
1     red   b     orange   m   20
2   green   c     banana   n   30
3  violet   d     grapes   o   40
4   white   e      melon   p   50
5   black   f  pineapple   q   60

In [18]:
pd_df1_1 = pd_df1

Removing a particular column

In [19]:
pd_df1_1.drop("four",axis=1)

  one      three two  ten
0   a      apple   l   10
1   b     orange   m   20
2   c     banana   n   30
3   d     grapes   o   40
4   e      melon   p   50
5   f  pineapple   q   60

Removing a particlaur row

In [20]:
pd_df1_1.drop(3,axis=0)

    four one      three two  ten
0   blue   a      apple   l   10
1    red   b     orange   m   20
2  green   c     banana   n   30
4  white   e      melon   p   50
5  black   f  pineapple   q   60

making changes of column or row of dataframe using inplace

In [21]:
pd_df1_1.drop(3,axis=0,inplace=True)

In [22]:
pd_df1_1

    four one      three two  ten
0   blue   a      apple   l   10
1    red   b     orange   m   20
2  green   c     banana   n   30
4  white   e      melon   p   50
5  black   f  pineapple   q   60

getting the dimension of a dataframe

In [23]:
pd_df1_1.shape

(5, 5)

Slicing of a dataframe with columns name

In [25]:
pd_df1.loc[:,"one":"three"]

  one      three
0   a      apple
1   b     orange
2   c     banana
4   e      melon
5   f  pineapple

Slicing of a dataframe with rows & columns names

In [26]:
pd_df1.loc[2:5,"one":"three"]

  one      three
2   c     banana
4   e      melon
5   f  pineapple

Accessing a dataframe based on condition of column or row values

In [27]:
pd_df1[pd_df1["ten"]>30]

    four one      three two  ten
4  white   e      melon   p   50
5  black   f  pineapple   q   60

Accessing a dataframe columns based on condition of column or row values

In [28]:
pd_df1[pd_df1["ten"]>30][["four","two"]]

    four two
4  white   p
5  black   q

In [29]:
pd_df2_1 = pd_df2_2 = pd_df2

In [30]:
pd_df2_1

     alfa beta
0    blue  NaN
1     red  NaN
2   green  NaN
3  violet  NaN
4   white    7
5   black    8
6     NaN    9
7     NaN    6

Dropping rows which are having nulls

In [31]:
pd_df2_1.dropna()

    alfa beta
4  white    7
5  black    8

Filling with specified values to a nulls

In [32]:
pd_df2_2.fillna(100)

     alfa beta
0    blue  100
1     red  100
2   green  100
3  violet  100
4   white    7
5   black    8
6     100    9
7     100    6

In [33]:
pds6=pd.Series(["apple","orange","banana","apple","orange","pineapple"],range(0,6,1))
pds7=pd.Series(range(100,700,100),range(0,6,1))
df4={"qwerty":pds6,"asdf":pds7}
pd_df4=pd.DataFrame(df4)

In [34]:
pd_df4

   asdf     qwerty
0   100      apple
1   200     orange
2   300     banana
3   400      apple
4   500     orange
5   600  pineapple

Grouping based on column values and applying a relationship on other columns

In [35]:
pd_df4.groupby("qwerty").mean()

           asdf
qwerty
apple       250
banana      300
orange      350
pineapple   600

describing characterstics of column with numirical data

In [36]:
pd_df4["asdf"].describe()

count      6.000000
mean     350.000000
std      187.082869
min      100.000000
25%      225.000000
50%      350.000000
75%      475.000000
max      600.000000
Name: asdf, dtype: float64

Desribing charaterstics of column with categorical data

In [37]:
pd_df4["qwerty"].describe()

count          6
unique         4
top       orange
freq           2
Name: qwerty, dtype: object

Dataframe concatenation

In [38]:
pds1=pd.Series(['a0','a1','a2'],range(3))
pds2=pd.Series(['b0','b1','b2'],range(2,5))
pds3=pd.Series(['a3','a4','a5'],range(3))
pds4=pd.Series(['b3','b4','b5'],range(2,5))

In [40]:
pda1=pd.DataFrame({'A1':pds1,'A2':pds3})

In [41]:
pdb1=pd.DataFrame({'B1':pds2,'B2':pds4})

In [42]:
pda1

   A1  A2
0  a0  a3
1  a1  a4
2  a2  a5

In [43]:
pdb1

   B1  B2
2  b0  b3
3  b1  b4
4  b2  b5

In [47]:
pd.concat([pda1,pdb1],axis=1)

    A1   A2   B1   B2
0   a0   a3  NaN  NaN
1   a1   a4  NaN  NaN
2   a2   a5   b0   b3
3  NaN  NaN   b1   b4
4  NaN  NaN   b2   b5

In [48]:
pd.concat([pda1,pdb1],axis=0)

    A1   A2   B1   B2
0   a0   a3  NaN  NaN
1   a1   a4  NaN  NaN
2   a2   a5  NaN  NaN
2  NaN  NaN   b0   b3
3  NaN  NaN   b1   b4
4  NaN  NaN   b2   b5

Dataframe join(it is basically on rows/indexes)

In [49]:
pda1.join(pdb1,how='inner')

   A1  A2  B1  B2
2  a2  a5  b0  b3

In [50]:
pda1.join(pdb1,how='outer')

    A1   A2   B1   B2
0   a0   a3  NaN  NaN
1   a1   a4  NaN  NaN
2   a2   a5   b0   b3
3  NaN  NaN   b1   b4
4  NaN  NaN   b2   b5

In [51]:
pda1.join(pdb1,how='left')

   A1  A2   B1   B2
0  a0  a3  NaN  NaN
1  a1  a4  NaN  NaN
2  a2  a5   b0   b3

In [52]:
pda1.join(pdb1,how='right')

    A1   A2  B1  B2
2   a2   a5  b0  b3
3  NaN  NaN  b1  b4
4  NaN  NaN  b2  b5